app/Controllers/Cliente.php

    public function index()
    {
        return view('clientes/clientes', [
            'clientes' => $this->clienteModel->findAll()
        ]);
---
SELECT *
FROM `cliente`