app/Controllers/Lojas.php

    public function index()
        {
            return view('lojas/index', [
                'lojas' => $this->LojasModel->findAll()
            ]);
---
SELECT *
FROM `lojas`

        public function edit($id) {
            return view('lojas/form', [
                'loja' => $this->LojasModel->find($id)
            ]);
---
SELECT *
FROM `lojas`
WHERE `lojas`.`id` = '2'