app/Controllers/Produto.php

    public function index()
    {
        return view('produto/index', [
            'produtos' => $this->ProdutoModel->findAll()
        ]);
---
SELECT *
FROM `produtos`

        public function edit($id) {
            return view('produto/form', [
                'produto' => $this->ProdutoModel->find($id)
            ]);
---
SELECT *
FROM `produtos`
WHERE `produtos`.`id` = '2'